// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Este software deve ser instalado no volume de inicialização.";
"ERROR_INSTALL" = "Este volume não preenche os requisitos para esta actualização.";

"Newer_Package_Installed_message" = "Uma versão mais recente do Chameleon já está instalada.";
"Intel_Mac_message" = "Este software não pode ser instalado neste computador.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "O Chameleon requer três arquivos essenciais (em termos simples):
boot0 (no MBR do drive) responsável por carregar o boot1.
boot1 (no setor de boot da particção) para encontrar o boot2.
boot2 (no directório raiz da particção) para carregar o kernel etc.";

"Standard_title" = "Padrão";
"Standard_description" = "Instalar os arquivos do Chameleon na raiz da particção selecçionada usando boot0 ou boot0md dependendo do seu sistema, sem danificar nenhuma instalacção do Windows, se existir.";

"EFI_title" = "EFI";
"EFI_description" = "Instalar os arquivos do Chameleon na particção EFI (normalmente oculta) usando boot0 ou boot0md dependendo do seu sistema, sem danificar nenhuma instalacção do Windows, se existir.";

"noboot_title" = "Não instalar o boot loader";
"noboot_description" = "Útil se você quer instalar apenas os extras.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Módulos do Chameleon";
"Module_description" = "O sistema de módulos incorporados ao Chameleon permite que um utilizador ou desenvolvedor estenda a funcionalidade básica sem precisar substituir o arquivo boot principal.";

"klibc_title" = "klibc";
"klibc_description" = "Este módulo fornece uma biblioteca C padrão para link, caso a do Chameleon seja insuficiente.
É usado actualmente apenas pela biblioteca uClibc++
Fonte: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolução";
"AutoReso_description" = "Este módulo lê a informação EDID do monitor conectado ao display principal.
Actualmente não está integrado ao trunk e tem uso mínimo no estado em que se encontra.
Adicionalmente o módulo ajusta os modos VESA disponíveis nas placas de vídeo pré Intel HD para proporcionar resolução adequada no boot.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Este módulo fornece uma biblioteca runtime C++ minimalista para uso em outros módulos.
Ele não fornece funcionalidade por si só, mas é usado para permitir o uso da linguagem C++ em outros módulos.
Observe que rtti e exceptions foram ambos desativados.
Fonte: http://cxx.uclibc.org/
Dependências: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Este módulo permite definir o mapeamento das teclas do teclado.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilitários";
"Utility_description" = "Arquivos opcionais para ajudar na configuração";

"PrefPanel_title" = "Painel de preferências";
"PrefPanel_description" = "Instala o painel de preferências do Chameleon.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Copia um exemplo de smbios.plist para /Extra/Configuration.";

"Documentation_title" = "Documentação";
"Documentation_description" = "Documentação para instalacção manual e uso do Chameleon.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opções de boot";
"Options_description" = "Cria um arquivo /Extra/org.chameleon.Boot.plist e selecçiona suas preferências de configuração do Chameleon.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Oculta o banner do Chameleon na interface gráfica.";

"GUI_title" = "GUI=No";
"GUI_description" = "Desabilita a interface gráfica, activada por padrão.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Usa o logotipo legado da Apple (cinza e branco) no écran de boot, e não o do boot.png do tema.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Exibe o écran de selecção de particção sem mostrar a contagem regressiva.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Activa o boot silencioso (sem mensagens ou opções).";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Desactiva a exibição de detalhes sobre particções e resolução do écran.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pausa o processo de boot após os ajustes do Chameleon e aguarda que uma tecla seja pressionada antes de iniciar o kernel. Útil para solução de problemas quando usado em conjunto com o boot verbose.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "Um contorno temporário para essa opção que impede o boot em RAID.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Inicia o sistema no modo 32 bit, e não no modo padrão 64 bit.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Activa a opção que corrige falhas de EHCI ownership devido a problemas no BIOS.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Activa a opção que inclui 'built-in' (integrado) nos dispositivos ethernet.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Activa o HPET em chipsets Intel, para BIOS que não incluem a opção.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Essa opção permite contornar imagens de repouso com problema.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Desabilita a correcção do problema ao reiniciar, activada por padrão.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Activa a opção que reinicia os controladores UHCI antes de iniciar o OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Desactiva a identificação automática de memória RAM.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Yes vai carregar o kernel pre-linked e ignorar /Extra/Extensions e o Extensions.mkext de /System/Library/Extensions. O padrão é No, mas se você usa o Lion numa partição RAID, é Yes.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Tenta carregar a imagem de repouso gravada na última hibernação.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Novo - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Novo método de geração de C-States usando registros do SystemIO ao invés de FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Descarta as tabelas SSDT da placa mãe.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Activa power state específico de processador, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Activa power state específico de processador, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Activa power state específico de processador, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Activa a geração automática de estados de idle sleep do processador (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Activa a geração automática de estados de power performance do processador (P-States).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Activa a opção que auto detecta placas de vídeo e injecta as informações corretas.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Activa a opção UseAtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Activa a opção UseNvidiaROM.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Activa a opção VBIOS.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Adiciona o parâmetro npci=0x2000 em Kernel Flags.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "Teclado Mac Alemão";
"mac-de_description" = "Usa o layout para teclado Mac Alemão.";

"mac-es_title" = "Teclado Mac Espanhol";
"mac-es_description" = "Usa o layout para teclado Mac Espanhol.";

"mac-fr_title" = "Teclado Mac Francês";
"mac-fr_description" = "Usa o layout para teclado Mac Francês.";

"mac-it_title" = "Teclado Mac Italiano";
"mac-it_description" = "Usa o layout para teclado Mac Italiano.";

"mac-se_title" = "Teclado Mac Sueco";
"mac-se_description" = "Usa o layout para teclado Mac Sueco.";

"pc-fr_title" = "Teclado PC Francês";
"pc-fr_description" = "Usa o layout para teclado PC Francês.";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Uma versão menor do novo tema padrão, usada nas versões do Chameleon com tema embutido.";

"Legacy_title" = "Legacy";
"Legacy_description" = "Tema padrão anterior do Chameleon.";

"Default_title" = "Standard";
"Default_description" = "Novo tema padrão do Chameleon.";

"Bullet_title" = "Bullet";
"Bullet_description" = "O tema Bullet por NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Resolução";
"Resolution_description" = "Configura a resolução do écran";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Configura o layout de teclado a ser usado.";

// Themes
"Themes_title" = "Temas";
"Themes_description" = "Alguns exemplos de tema.
Mais temas podem ser encontrados em http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
